2023-07-22 18:15:22.934279: I tensorflow/core/platform/cpu_feature_guard.cc:182] This TensorFlow binary is optimized to use available CPU instructions in performance-critical operations.
To enable the following instructions: SSE SSE2 SSE3 SSE4.1 SSE4.2 AVX AVX2 AVX512F AVX512_VNNI FMA, in other operations, rebuild TensorFlow with the appropriate compiler flags.
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense (Dense)               (None, 78)                312       
                                                                 
 dense_1 (Dense)             (None, 54)                4266      
                                                                 
 dense_2 (Dense)             (None, 54)                2970      
                                                                 
 dense_3 (Dense)             (None, 5)                 275       
                                                                 
=================================================================
Total params: 7823 (30.56 KB)
Trainable params: 7823 (30.56 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
None
Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 3)]               0         
                                                                 
 dense_4 (Dense)             (None, 78)                312       
                                                                 
 dense_5 (Dense)             (None, 54)                4266      
                                                                 
 dense_6 (Dense)             (None, 54)                2970      
                                                                 
 dense_7 (Dense)             (None, 5)                 275       
                                                                 
=================================================================
Total params: 7823 (30.56 KB)
Trainable params: 7823 (30.56 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
None
